Dartlead/STM32F446RE/peripheral_library/private/_stm32f446re_registers.h
#include <stdint.h>

#ifndef _STM32F446RE_REGISTERS_H
#define _STM32F446RE_REGISTERS_H
/* ============================================================================================================= */
/* Basic Timers Registers (BTIM)                                                                                 */
/* Address Ranges:                                                                                               */
/* TIM6: 0x4000 1000 - 0x4000 13FF                                                                               */
/* TIM7: 0x4000 1400 - 0x4000 17FF                                                                               */
/* ============================================================================================================= */
#define BTIM_CR1_OFFSET  0x00U /* Offset: 0x00 (R/W) Control Register 1            */
#define BTIM_CR2_OFFSET  0x04U /* Offset: 0x04 (R/W) Control Register 2            */
#define BTIM_DIER_OFFSET 0x0CU /* Offset: 0x0C (R/W) DMA/Interrupt Enable Register */
#define BTIM_SR_OFFSET   0x10U /* Offset: 0x10 (R/ ) Status Register               */
#define BTIM_EGR_OFFSET  0x14U /* Offset: 0x14 ( /W) Event Generation Register     */
#define BTIM_CNT_OFFSET  0x24U /* Offset: 0x24 (R/W) Count Register                */
#define BTIM_PSC_OFFSET  0x28U /* Offset: 0x28 (R/W) Prescalar Register            */
#define BTIM_ARR_OFFSET  0x2CU /* Offset: 0x2C (R/W) Auto-Reload Register          */

#define TIM6_B_ADDR 0x40001000
#define TIM7_B_ADDR 0x40001400

#define TIM6_CR1  *((uint32_t volatile *)((uint8_t *)TIM6_B_ADDR + BTIM_CR1_OFFSET))
#define TIM6_CR2  *((uint32_t volatile *)((uint8_t *)TIM6_B_ADDR + BTIM_CR2_OFFSET))
#define TIM6_DIER *((uint32_t volatile *)((uint8_t *)TIM6_B_ADDR + BTIM_DIER_OFFSET))
#define TIM6_SR   *((uint32_t volatile *)((uint8_t *)TIM6_B_ADDR + BTIM_SR_OFFSET))
#define TIM6_EGR  *((uint32_t volatile *)((uint8_t *)TIM6_B_ADDR + BTIM_EGR_OFFSET))
#define TIM6_CNT  *((uint32_t volatile *)((uint8_t *)TIM6_B_ADDR + BTIM_CNT_OFFSET))
#define TIM6_PSC  *((uint32_t volatile *)((uint8_t *)TIM6_B_ADDR + BTIM_PSC_OFFSET))
#define TIM6_ARR  *((uint32_t volatile *)((uint8_t *)TIM6_B_ADDR + BTIM_ARR_OFFSET))

#define TIM7_CR1  *((uint32_t volatile *)((uint8_t *)TIM7_B_ADDR + BTIM_CR1_OFFSET))
#define TIM7_CR2  *((uint32_t volatile *)((uint8_t *)TIM7_B_ADDR + BTIM_CR2_OFFSET))
#define TIM7_DIER *((uint32_t volatile *)((uint8_t *)TIM7_B_ADDR + BTIM_DIER_OFFSET))
#define TIM7_SR   *((uint32_t volatile *)((uint8_t *)TIM7_B_ADDR + BTIM_SR_OFFSET))
#define TIM7_EGR  *((uint32_t volatile *)((uint8_t *)TIM7_B_ADDR + BTIM_EGR_OFFSET))
#define TIM7_CNT  *((uint32_t volatile *)((uint8_t *)TIM7_B_ADDR + BTIM_CNT_OFFSET))
#define TIM7_PSC  *((uint32_t volatile *)((uint8_t *)TIM7_B_ADDR + BTIM_PSC_OFFSET))
#define TIM7_ARR  *((uint32_t volatile *)((uint8_t *)TIM7_B_ADDR + BTIM_ARR_OFFSET))

/* ============================================================================================================= */
/* Universal Synchronous/Asynchronous Receiver Transmitter Channels 1 - 6 Registers (USART)                      */
/* Address Ranges:                                                                                               */
/* USART1: 0x4001 1000 - 0x4001 13FF                                                                             */
/* USART2: 0x4000 4400 - 0x4000 47FF                                                                             */
/* USART3: 0x4000 4800 - 0x4000 4BFF                                                                             */
/* UART4:  0x4000 4C00 - 0x4000 4FFF                                                                             */
/* UART5:  0x4000 5000 - 0x4000 53FF                                                                             */
/* USART6: 0x4001 1400 - 0x4001 17FF                                                                             */
/* ============================================================================================================= */
#define USART_SR_OFFSET   0x00U /* Offset: 0x00 (R/W) Status Register                   */
#define USART_DR_OFFSET   0x04U /* Offset: 0x04 (R/W) Data Register                     */
#define USART_BRR_OFFSET  0x08U /* Offset: 0x08 (R/W) Baud Rate Register                */
#define USART_CR1_OFFSET  0x0CU /* Offset: 0x0C (R/W) Control Register 1                */
#define USART_CR2_OFFSET  0x10U /* Offset: 0x10 (R/W) Control Register 2                */
#define USART_CR3_OFFSET  0x14U /* Offset: 0x14 (R/W) Control Register 3                */
#define USART_GTPR_OFFSET 0x18U /* Offset: 0x18 (R/W) Guard Time and Prescalar Register */

#define USART1_B_ADDR 0x40011000
#define USART2_B_ADDR 0x40004400
#define USART3_B_ADDR 0x40004800
#define UART4_B_ADDR  0x40004C00
#define UART5_B_ADDR  0x40005000
#define USART6_B_ADDR 0x40011400

#define USART1_SR   *((uint32_t volatile *)((uint8_t *)USART1_B_ADDR + USART_SR_OFFSET))
#define USART1_DR   *((uint32_t volatile *)((uint8_t *)USART1_B_ADDR + USART_DR_OFFSET))
#define USART1_BRR  *((uint32_t volatile *)((uint8_t *)USART1_B_ADDR + USART_BRR_OFFSET))
#define USART1_CR1  *((uint32_t volatile *)((uint8_t *)USART1_B_ADDR + USART_CR1_OFFSET))
#define USART1_CR2  *((uint32_t volatile *)((uint8_t *)USART1_B_ADDR + USART_CR2_OFFSET))
#define USART1_CR3  *((uint32_t volatile *)((uint8_t *)USART1_B_ADDR + USART_CR3_OFFSET))
#define USART1_GTPR *((uint32_t volatile *)((uint8_t *)USART1_B_ADDR + USART_GTPR_OFFSET))

#define USART2_SR   *((uint32_t volatile *)((uint8_t *)USART2_B_ADDR + USART_SR_OFFSET))
#define USART2_DR   *((uint32_t volatile *)((uint8_t *)USART2_B_ADDR + USART_DR_OFFSET))
#define USART2_BRR  *((uint32_t volatile *)((uint8_t *)USART2_B_ADDR + USART_BRR_OFFSET))
#define USART2_CR1  *((uint32_t volatile *)((uint8_t *)USART2_B_ADDR + USART_CR1_OFFSET))
#define USART2_CR2  *((uint32_t volatile *)((uint8_t *)USART2_B_ADDR + USART_CR2_OFFSET))
#define USART2_CR3  *((uint32_t volatile *)((uint8_t *)USART2_B_ADDR + USART_CR3_OFFSET))
#define USART2_GTPR *((uint32_t volatile *)((uint8_t *)USART2_B_ADDR + USART_GTPR_OFFSET))

#define USART3_SR   *((uint32_t volatile *)((uint8_t *)USART3_B_ADDR + USART_SR_OFFSET))
#define USART3_DR   *((uint32_t volatile *)((uint8_t *)USART3_B_ADDR + USART_DR_OFFSET))
#define USART3_BRR  *((uint32_t volatile *)((uint8_t *)USART3_B_ADDR + USART_BRR_OFFSET))
#define USART3_CR1  *((uint32_t volatile *)((uint8_t *)USART3_B_ADDR + USART_CR1_OFFSET))
#define USART3_CR2  *((uint32_t volatile *)((uint8_t *)USART3_B_ADDR + USART_CR2_OFFSET))
#define USART3_CR3  *((uint32_t volatile *)((uint8_t *)USART3_B_ADDR + USART_CR3_OFFSET))
#define USART3_GTPR *((uint32_t volatile *)((uint8_t *)USART3_B_ADDR + USART_GTPR_OFFSET))

