Dartlead/STM32F446RE/peripheral_library/private/_stm32f446re_registers.h
#define UART4_SR    *((uint32_t volatile *)((uint8_t *)UART4_B_ADDR + USART_SR_OFFSET))
#define UART4_DR    *((uint32_t volatile *)((uint8_t *)UART4_B_ADDR + USART_DR_OFFSET))
#define UART4_BRR   *((uint32_t volatile *)((uint8_t *)UART4_B_ADDR + USART_BRR_OFFSET))
#define UART4_CR1   *((uint32_t volatile *)((uint8_t *)UART4_B_ADDR + USART_CR1_OFFSET))
#define UART4_CR2   *((uint32_t volatile *)((uint8_t *)UART4_B_ADDR + USART_CR2_OFFSET))
#define UART4_CR3   *((uint32_t volatile *)((uint8_t *)UART4_B_ADDR + USART_CR3_OFFSET))
#define UART4_GTPR  *((uint32_t volatile *)((uint8_t *)UART4_B_ADDR + USART_GTPR_OFFSET))

#define UART5_SR    *((uint32_t volatile *)((uint8_t *)UART5_B_ADDR + USART_SR_OFFSET))
#define UART5_DR    *((uint32_t volatile *)((uint8_t *)UART5_B_ADDR + USART_DR_OFFSET))
#define UART5_BRR   *((uint32_t volatile *)((uint8_t *)UART5_B_ADDR + USART_BRR_OFFSET))
#define UART5_CR1   *((uint32_t volatile *)((uint8_t *)UART5_B_ADDR + USART_CR1_OFFSET))
#define UART5_CR2   *((uint32_t volatile *)((uint8_t *)UART5_B_ADDR + USART_CR2_OFFSET))
#define UART5_CR3   *((uint32_t volatile *)((uint8_t *)UART5_B_ADDR + USART_CR3_OFFSET))
#define UART5_GTPR  *((uint32_t volatile *)((uint8_t *)UART5_B_ADDR + USART_GTPR_OFFSET))

#define USART6_SR   *((uint32_t volatile *)((uint8_t *)USART6_B_ADDR + USART_SR_OFFSET))
#define USART6_DR   *((uint32_t volatile *)((uint8_t *)USART6_B_ADDR + USART_DR_OFFSET))
#define USART6_BRR  *((uint32_t volatile *)((uint8_t *)USART6_B_ADDR + USART_BRR_OFFSET))
#define USART6_CR1  *((uint32_t volatile *)((uint8_t *)USART6_B_ADDR + USART_CR1_OFFSET))
#define USART6_CR2  *((uint32_t volatile *)((uint8_t *)USART6_B_ADDR + USART_CR2_OFFSET))
#define USART6_CR3  *((uint32_t volatile *)((uint8_t *)USART6_B_ADDR + USART_CR3_OFFSET))
#define USART6_GTPR *((uint32_t volatile *)((uint8_t *)USART6_B_ADDR + USART_GTPR_OFFSET))

/* ============================================================================================================= */
/* System Configuration Registers (SYSCFG)                                                                       */
/* Address Range: 0x4001 3800 - 0x4001 3BFF                                                                      */
/* ============================================================================================================= */
#define SYSCFG_MEMRMP_OFFSET  0x00U /* Offset: 0x00 (R/W) Memory Remap Register                       */
#define SYSCFG_PMC_OFFSET     0x04U /* Offset: 0x04 (R/W) Peripheral Mode Configuration Register      */
#define SYSCFG_EXTICR1_OFFSET 0x08U /* Offset: 0x08 (R/W) External Interrupt Configuration Register 1 */
#define SYSCFG_EXTICR2_OFFSET 0x0CU /* Offset: 0x0C (R/W) External Interrupt Configuration Register 2 */
#define SYSCFG_EXTICR3_OFFSET 0x10U /* Offset: 0x10 (R/W) External Interrupt Configuration Register 3 */
#define SYSCFG_EXTICR4_OFFSET 0x14U /* Offset: 0x14 (R/W) External Interrupt Configuration Register 4 */
#define SYSCFG_CMPCR_OFFSET   0x20U /* Offset: 0x20 (R/W) Compensation Cell Control Register          */
#define SYSCFG_CFGR_OFFSET    0x2CU /* Offset: 0x2C (R/W) Configuration Register                      */

#define SYSCFG_B_ADDR 0x40013800

#define SYSCFG_MEMRMP  *((uint32_t volatile *)((uint8_t *)SYSCFG_B_ADDR + SYSCFG_MEMRMP_OFFSET))
#define SYSCFG_PMC     *((uint32_t volatile *)((uint8_t *)SYSCFG_B_ADDR + SYSCFG_PMC_OFFSET))
#define SYSCFG_EXTICR1 *((uint32_t volatile *)((uint8_t *)SYSCFG_B_ADDR + SYSCFG_EXTICR1_OFFSET))
#define SYSCFG_EXTICR2 *((uint32_t volatile *)((uint8_t *)SYSCFG_B_ADDR + SYSCFG_EXTICR2_OFFSET))
#define SYSCFG_EXTICR3 *((uint32_t volatile *)((uint8_t *)SYSCFG_B_ADDR + SYSCFG_EXTICR3_OFFSET))
#define SYSCFG_EXTICR4 *((uint32_t volatile *)((uint8_t *)SYSCFG_B_ADDR + SYSCFG_EXTICR4_OFFSET))
#define SYSCFG_CMPCR   *((uint32_t volatile *)((uint8_t *)SYSCFG_B_ADDR + SYSCFG_CMPCR_OFFSET))
#define SYSCFG_CFGR    *((uint32_t volatile *)((uint8_t *)SYSCFG_B_ADDR + SYSCFG_CFGR_OFFSET))

/* ============================================================================================================= */
/* External Interrupt Controller Registers (EXTI)                                                                */
/* Address Range: 0x4001 3C00 - 0x4001 3FFF                                                                      */
/* ============================================================================================================= */
#define EXTI_IMR_OFFSET   0x00U /* Offset: 0x00 (R/W) Interrupt Mask Register            */
#define EXTI_EMR_OFFSET   0x04U /* Offset: 0x04 (R/W) Event Mask Register                */
#define EXTI_RTSR_OFFSET  0x08U /* Offset: 0x08 (R/W) Rising Trigger Selection Register  */
#define EXTI_FTSR_OFFSET  0x0CU /* Offset: 0x0C (R/W) Falling Trigger Selection Register */
#define EXTI_SWIER_OFFSET 0x10U /* Offset: 0x10 (R/W) Software Interrupt Event Register  */
#define EXTI_PR_OFFSET    0x14U /* Offset: 0x14 (R/W) Pending Register                   */

#define EXTI_B_ADDR 0x40013C00

#define EXTI_IMR   *((uint32_t volatile *)((uint8_t *)EXTI_B_ADDR + EXTI_IMR_OFFSET))
#define EXTI_EMR   *((uint32_t volatile *)((uint8_t *)EXTI_B_ADDR + EXTI_EMR_OFFSET))
#define EXTI_RTSR  *((uint32_t volatile *)((uint8_t *)EXTI_B_ADDR + EXTI_RTSR_OFFSET))
#define EXTI_FTSR  *((uint32_t volatile *)((uint8_t *)EXTI_B_ADDR + EXTI_FTSR_OFFSET))
#define EXTI_SWIER *((uint32_t volatile *)((uint8_t *)EXTI_B_ADDR + EXTI_SWIER_OFFSET))
#define EXTI_PR    *((uint32_t volatile *)((uint8_t *)EXTI_B_ADDR + EXTI_PR_OFFSET))

/* ============================================================================================================= */
/* General Purpose Input Output Registers (GPIO)                                                                 */
/* Address Range: 0x4002 0000 - 0x4002 1FFF                                                                      */
/* ============================================================================================================= */
#define GPIO_MODER_OFFSET   0x00U /* Offset: 0x00 (R/W) Mode Register                    */
#define GPIO_OTYPER_OFFSET  0x04U /* Offset: 0x04 (R/W) Output Type Register             */
#define GPIO_OSPEEDR_OFFSET 0x08U /* Offset: 0x08 (R/W) Output Speed Register            */
#define GPIO_PUPDR_OFFSET   0x0CU /* Offset: 0x0C (R/W) Pull-up/Pull-down Register       */
#define GPIO_IDR_OFFSET     0x10U /* Offset: 0x10 (R/W) Input Data Register              */
#define GPIO_ODR_OFFSET     0x14U /* Offset: 0x14 (R/W) Output Data Register             */
#define GPIO_BSRR_OFFSET    0x18U /* Offset: 0x18 (R/W) Bit Set/Reset Register           */
#define GPIO_LCKR_OFFSET    0x1CU /* Offset: 0x1C (R/W) Configuration Lock Register      */
#define GPIO_AFRL_OFFSET    0x20U /* Offset: 0x20 (R/W) Alternate Function Low Register  */
#define GPIO_AFRH_OFFSET    0x24U /* Offset: 0x24 (R/W) Alternate Function High Register */

#define GPIOA_B_ADDR 0x40020000
#define GPIOB_B_ADDR 0x40020400
#define GPIOC_B_ADDR 0x40020800
#define GPIOD_B_ADDR 0x40020C00
#define GPIOE_B_ADDR 0x40021000
#define GPIOF_B_ADDR 0x40021400
#define GPIOG_B_ADDR 0x40021800
#define GPIOH_B_ADDR 0x40021C00

#define GPIOA_MODER   *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_MODER_OFFSET))
#define GPIOA_OTYPER  *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_OTYPER_OFFSET))
#define GPIOA_OSPEEDR *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_OSPEEDR_OFFSET))
#define GPIOA_PUPDR   *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_PUPDR_OFFSET))
#define GPIOA_IDR     *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_IDR_OFFSET))
#define GPIOA_ODR     *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_ODR_OFFSET))
#define GPIOA_BSRR    *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_BSRR_OFFSET))
#define GPIOA_LCKR    *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_LCKR_OFFSET))
#define GPIOA_AFRL    *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_AFRL_OFFSET))
#define GPIOA_AFRH    *((uint32_t volatile *)((uint8_t *)GPIOA_B_ADDR + GPIO_AFRH_OFFSET))

