Dartlead/STM32F446RE/peripheral_library/private/_stm32f446re_registers.h
#define GPIOB_MODER   *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_MODER_OFFSET))
#define GPIOB_OTYPER  *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_OTYPER_OFFSET))
#define GPIOB_OSPEEDR *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_OSPEEDR_OFFSET))
#define GPIOB_PUPDR   *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_PUPDR_OFFSET))
#define GPIOB_IDR     *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_IDR_OFFSET))
#define GPIOB_ODR     *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_ODR_OFFSET))
#define GPIOB_BSRR    *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_BSRR_OFFSET))
#define GPIOB_LCKR    *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_LCKR_OFFSET))
#define GPIOB_AFRL    *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_AFRL_OFFSET))
#define GPIOB_AFRH    *((uint32_t volatile *)((uint8_t *)GPIOB_B_ADDR + GPIO_AFRH_OFFSET))

#define GPIOC_MODER   *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_MODER_OFFSET))
#define GPIOC_OTYPER  *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_OTYPER_OFFSET))
#define GPIOC_OSPEEDR *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_OSPEEDR_OFFSET))
#define GPIOC_PUPDR   *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_PUPDR_OFFSET))
#define GPIOC_IDR     *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_IDR_OFFSET))
#define GPIOC_ODR     *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_ODR_OFFSET))
#define GPIOC_BSRR    *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_BSRR_OFFSET))
#define GPIOC_LCKR    *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_LCKR_OFFSET))
#define GPIOC_AFRL    *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_AFRL_OFFSET))
#define GPIOC_AFRH    *((uint32_t volatile *)((uint8_t *)GPIOC_B_ADDR + GPIO_AFRH_OFFSET))

#define GPIOD_MODER   *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_MODER_OFFSET))
#define GPIOD_OTYPER  *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_OTYPER_OFFSET))
#define GPIOD_OSPEEDR *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_OSPEEDR_OFFSET))
#define GPIOD_PUPDR   *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_PUPDR_OFFSET))
#define GPIOD_IDR     *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_IDR_OFFSET))
#define GPIOD_ODR     *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_ODR_OFFSET))
#define GPIOD_BSRR    *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_BSRR_OFFSET))
#define GPIOD_LCKR    *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_LCKR_OFFSET))
#define GPIOD_AFRL    *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_AFRL_OFFSET))
#define GPIOD_AFRH    *((uint32_t volatile *)((uint8_t *)GPIOD_B_ADDR + GPIO_AFRH_OFFSET))

#define GPIOE_MODER   *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_MODER_OFFSET))
#define GPIOE_OTYPER  *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_OTYPER_OFFSET))
#define GPIOE_OSPEEDR *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_OSPEEDR_OFFSET))
#define GPIOE_PUPDR   *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_PUPDR_OFFSET))
#define GPIOE_IDR     *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_IDR_OFFSET))
#define GPIOE_ODR     *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_ODR_OFFSET))
#define GPIOE_BSRR    *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_BSRR_OFFSET))
#define GPIOE_LCKR    *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_LCKR_OFFSET))
#define GPIOE_AFRL    *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_AFRL_OFFSET))
#define GPIOE_AFRH    *((uint32_t volatile *)((uint8_t *)GPIOE_B_ADDR + GPIO_AFRH_OFFSET))

#define GPIOF_MODER   *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_MODER_OFFSET))
#define GPIOF_OTYPER  *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_OTYPER_OFFSET))
#define GPIOF_OSPEEDR *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_OSPEEDR_OFFSET))
#define GPIOF_PUPDR   *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_PUPDR_OFFSET))
#define GPIOF_IDR     *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_IDR_OFFSET))
#define GPIOF_ODR     *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_ODR_OFFSET))
#define GPIOF_BSRR    *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_BSRR_OFFSET))
#define GPIOF_LCKR    *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_LCKR_OFFSET))
#define GPIOF_AFRL    *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_AFRL_OFFSET))
#define GPIOF_AFRH    *((uint32_t volatile *)((uint8_t *)GPIOF_B_ADDR + GPIO_AFRH_OFFSET))

#define GPIOG_MODER   *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_MODER_OFFSET))
#define GPIOG_OTYPER  *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_OTYPER_OFFSET))
#define GPIOG_OSPEEDR *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_OSPEEDR_OFFSET))
#define GPIOG_PUPDR   *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_PUPDR_OFFSET))
#define GPIOG_IDR     *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_IDR_OFFSET))
#define GPIOG_ODR     *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_ODR_OFFSET))
#define GPIOG_BSRR    *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_BSRR_OFFSET))
#define GPIOG_LCKR    *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_LCKR_OFFSET))
#define GPIOG_AFRL    *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_AFRL_OFFSET))
#define GPIOG_AFRH    *((uint32_t volatile *)((uint8_t *)GPIOG_B_ADDR + GPIO_AFRH_OFFSET))

#define GPIOH_MODER   *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_MODER_OFFSET))
#define GPIOH_OTYPER  *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_OTYPER_OFFSET))
#define GPIOH_OSPEEDR *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_OSPEEDR_OFFSET))
#define GPIOH_PUPDR   *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_PUPDR_OFFSET))
#define GPIOH_IDR     *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_IDR_OFFSET))
#define GPIOH_ODR     *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_ODR_OFFSET))
#define GPIOH_BSRR    *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_BSRR_OFFSET))
#define GPIOH_LCKR    *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_LCKR_OFFSET))
#define GPIOH_AFRL    *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_AFRL_OFFSET))
#define GPIOH_AFRH    *((uint32_t volatile *)((uint8_t *)GPIOH_B_ADDR + GPIO_AFRH_OFFSET))

/* ============================================================================================================= */
/* Reset and Clock Control Registers (RCC)                                                                       */
/* Address Range: 0x4002 3800 - 0x4002 3BFF                                                                      */
/* ============================================================================================================= */
#define RCC_CR_OFFSET         0x00U /* Offset: 0x00 (R/W) Clock Control Register                                 */
#define RCC_PLLCFGR_OFFSET    0x04U /* Offset: 0x04 (R/W) PLL Configuration Register                             */
#define RCC_CFGR_OFFSET       0x08U /* Offset: 0x08 (R/W) Clock Configuration Register                           */
#define RCC_CIR_OFFSET        0x0CU /* Offset: 0x0C (R/W) Clock Interrupt Register                               */
#define RCC_AHB1RSTR_OFFSET   0x10U /* Offset: 0x10 (R/W) AHB1 Peripheral Reset Register                         */
#define RCC_AHB2RSTR_OFFSET   0x14U /* Offset: 0x14 (R/W) AHB2 Peripheral Reset Register                         */
#define RCC_AHB3RSTR_OFFSET   0x18U /* Offset: 0x18 (R/W) AHB3 Peripheral Reset Register                         */
#define RCC_APB1RSTR_OFFSET   0x20U /* Offset: 0x20 (R/W) APB1 Peripheral Reset Register                         */
#define RCC_APB2RSTR_OFFSET   0x24U /* Offset: 0x24 (R/W) APB2 Peripheral Reset Register                         */
#define RCC_AHB1ENR_OFFSET    0x30U /* Offset: 0x30 (R/W) AHB1 Peripheral Clock Enable Register                  */
#define RCC_AHB2ENR_OFFSET    0x34U /* Offset: 0x34 (R/W) AHB2 Peripheral Clock Enable Register                  */
#define RCC_AHB3ENR_OFFSET    0x38U /* Offset: 0x38 (R/W) AHB3 Peripheral Clock Enable Register                  */
#define RCC_APB1ENR_OFFSET    0x40U /* Offset: 0x40 (R/W) APB1 Peripheral Clock Enable Register                  */
#define RCC_APB2ENR_OFFSET    0x44U /* Offset: 0x44 (R/W) APB1 Peripheral Clock Enable Register                  */
#define RCC_AHB1LPENR_OFFSET  0x50U /* Offset: 0x50 (R/W) AHB1 Peripheral Clock Enable Lower Power Mode Register */
#define RCC_AHB2LPENR_OFFSET  0x54U /* Offset: 0x54 (R/W) AHB2 Peripheral Clock Enable Lower Power Mode Register */
#define RCC_AHB3LPENR_OFFSET  0x58U /* Offset: 0x58 (R/W) AHB3 Peripheral Clock Enable Lower Power Mode Register */
#define RCC_APB1LPENR_OFFSET  0x60U /* Offset: 0x60 (R/W) APB1 Peripheral Clock Enable Lower Power Mode Register */
#define RCC_APB2LPENR_OFFSET  0x64U /* Offset: 0x64 (R/W) APB2 Peripheral Clock Enable Lower Power Mode Register */
#define RCC_BDCR_OFFSET       0x70U /* Offset: 0x70 (R/W) Backup Domain Control Register                         */
#define RCC_CSR_OFFSET        0x74U /* Offset: 0x74 (R/W) Clock Control & Status Register                        */
#define RCC_SSCGR_OFFSET      0x80U /* Offset: 0x80 (R/W) Spread Spectrum Clock Generation Register              */
#define RCC_PLLI2SCFGR_OFFSET 0x84U /* Offset: 0x84 (R/W) PLLI2S Configuration Register                          */
#define RCC_PLLSAICFGR_OFFSET 0x88U /* Offset: 0x88 (R/W) PLLSAI Configuration Register                          */
#define RCC_DCKCFGR_OFFSET    0x8CU /* Offset: 0x8C (R/W) Dedicated Clocks Configuration Register                */
#define RCC_CKGATENR_OFFSET   0x90U /* Offset: 0x90 (R/W) Clocks Gated Enabled Register                          */
#define RCC_DCKCFGR2_OFFSET   0x94U /* Offset: 0x94 (R/W) Dedicated Clocks Configuration Register 2              */

#define RCC_B_ADDR 0x40023800

#define RCC_CR         *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_CR_OFFSET))
#define RCC_PLLCFGR    *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_PLLCFGR_OFFSET))
#define RCC_CFGR       *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_CFGR_OFFSET))
#define RCC_CIR        *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_CIR_OFFSET))
#define RCC_AHB1RSTR   *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB1RSTR_OFFSET))
#define RCC_AHB2RSTR   *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB2RSTR_OFFSET))
#define RCC_AHB3RSTR   *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB3RSTR_OFFSET))
#define RCC_APB1RSTR   *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_APB1RSTR_OFFSET))
#define RCC_APB2RSTR   *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_APB2RSTR_OFFSET))
#define RCC_AHB1ENR    *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB1ENR_OFFSET))
#define RCC_AHB2ENR    *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB2ENR_OFFSET))
#define RCC_AHB3ENR    *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB3ENR_OFFSET))
#define RCC_APB1ENR    *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_APB1ENR_OFFSET))
#define RCC_APB2ENR    *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_APB2ENR_OFFSET))
#define RCC_AHB1LPENR  *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB1LPENR_OFFSET))
#define RCC_AHB2LPENR  *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB2LPENR_OFFSET))
#define RCC_AHB3LPENR  *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_AHB3LPENR_OFFSET))
#define RCC_APB1LPENR  *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_APB1LPENR_OFFSET))
#define RCC_APB2LPENR  *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_APB2LPENR_OFFSET))
#define RCC_BDCR       *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_BDCR_OFFSET))
#define RCC_CSR        *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_CSR_OFFSET))
#define RCC_SSCGR      *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_SSCGR_OFFSET))
#define RCC_PLLI2SCFGR *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_PLLI2SCFGR_OFFSET))
#define RCC_PLLSAICFGR *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_PLLSAICFGR_OFFSET))
#define RCC_DCKCFGR    *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_DCKCFGR_OFFSET))
#define RCC_CKGATENR   *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_CKGATENR_OFFSET))
#define RCC_DCKCFGR2   *((uint32_t volatile *)((uint8_t *)RCC_B_ADDR + RCC_DCKCFGR2_OFFSET))

/* ============================================================================================================= */
/* Direct Memory Access Controller Registers (DMA)                                                               */
/* Address Range:                                                                                                */
/* DMA1: 0x4002 6000 - 0x4002 63FF                                                                               */
/* DMA2: 0x4002 6400 - 0x4002 67FF                                                                               */
/* ============================================================================================================= */
#define DMA_LISR_OFFSET   0x00U /* Offset: 0x00 (R/ ) Low Interrupt Status Register        */
#define DMA_HISR_OFFSET   0x04U /* Offset: 0x04 (R/ ) High Interrupt Status Register       */
#define DMA_LIFCR_OFFSET  0x08U /* Offset: 0x08 ( /W) Low Interrupt Flag Clear Register    */
#define DMA_HIFCR_OFFSET  0x0CU /* Offset: 0x0C ( /W) High Interrupt Flag Clear Register   */
#define DMA_S0CR_OFFSET   0x10U /* Offset: 0x10 (R/W) Stream 0 Configuration Register      */
#define DMA_S0NDTR_OFFSET 0x14U /* Offset: 0x14 (R/W) Stream 0 Number of Data Register     */
#define DMA_S0PAR_OFFSET  0x18U /* Offset: 0x18 (R/W) Stream 0 Peripheral Address Register */
#define DMA_S0M0AR_OFFSET 0x1CU /* Offset: 0x1C (R/W) Stream 0 Memory 0 Address Register   */
#define DMA_S0M1AR_OFFSET 0x20U /* Offset: 0x20 (R/W) Stream 0 Memory 1 Address Register   */
#define DMA_S0FCR_OFFSET  0x24U /* Offset: 0x24 (R/W) Stream 0 FIFO Control Register       */
#define DMA_S1CR_OFFSET   0x28U /* Offset: 0x28 (R/W) Stream 1 Configuration Register      */
#define DMA_S1NDTR_OFFSET 0x2CU /* Offset: 0x2C (R/W) Stream 1 Number of Data Register     */
#define DMA_S1PAR_OFFSET  0x30U /* Offset: 0x30 (R/W) Stream 1 Peripheral Address Register */
#define DMA_S1M0AR_OFFSET 0x34U /* Offset: 0x34 (R/W) Stream 1 Memory 0 Address Register   */
#define DMA_S1M1AR_OFFSET 0x38U /* Offset: 0x38 (R/W) Stream 1 Memory 1 Address Register   */
#define DMA_S1FCR_OFFSET  0x3CU /* Offset: 0x3C (R/W) Stream 1 FIFO Control Register       */
#define DMA_S2CR_OFFSET   0x40U /* Offset: 0x40 (R/W) Stream 2 Configuration Register      */
#define DMA_S2NDTR_OFFSET 0x44U /* Offset: 0x44 (R/W) Stream 2 Number of Data Register     */
#define DMA_S2PAR_OFFSET  0x48U /* Offset: 0x48 (R/W) Stream 2 Peripheral Address Register */
#define DMA_S2M0AR_OFFSET 0x4CU /* Offset: 0x4C (R/W) Stream 2 Memory 0 Address Register   */
#define DMA_S2M1AR_OFFSET 0x50U /* Offset: 0x50 (R/W) Stream 2 Memory 1 Address Register   */
#define DMA_S2FCR_OFFSET  0x54U /* Offset: 0x54 (R/W) Stream 2 FIFO Control Register       */
#define DMA_S3CR_OFFSET   0x58U /* Offset: 0x58 (R/W) Stream 3 Configuration Register      */
#define DMA_S3NDTR_OFFSET 0x5CU /* Offset: 0x5C (R/W) Stream 3 Number of Data Register     */
#define DMA_S3PAR_OFFSET  0x60U /* Offset: 0x60 (R/W) Stream 3 Peripheral Address Register */
#define DMA_S3M0AR_OFFSET 0x64U /* Offset: 0x64 (R/W) Stream 3 Memory 0 Address Register   */
#define DMA_S3M1AR_OFFSET 0x68U /* Offset: 0x68 (R/W) Stream 3 Memory 0 Address Register   */
#define DMA_S3FCR_OFFSET  0x6CU /* Offset: 0x6C (R/W) Stream 3 FIFO Control Register       */
#define DMA_S4CR_OFFSET   0x70U /* Offset: 0x70 (R/W) Stream 4 Configuration Register      */
#define DMA_S4NDTR_OFFSET 0x74U /* Offset: 0x74 (R/W) Stream 4 Number of Data Register     */
#define DMA_S4PAR_OFFSET  0x78U /* Offset: 0x78 (R/W) Stream 4 Peripheral Address Register */
#define DMA_S4M0AR_OFFSET 0x7CU /* Offset: 0x7C (R/W) Stream 4 Memory 0 Address Register   */
#define DMA_S4M1AR_OFFSET 0x80U /* Offset: 0x80 (R/W) Stream 4 Memory 1 Address Register   */
#define DMA_S4FCR_OFFSET  0x84U /* Offset: 0x84 (R/W) Stream 4 FIFO Control Register       */
#define DMA_S5CR_OFFSET   0x88U /* Offset: 0x88 (R/W) Stream 5 Configuration Register      */
#define DMA_S5NDTR_OFFSET 0x8CU /* Offset: 0x8C (R/W) Stream 5 Number of Data Register     */
#define DMA_S5PAR_OFFSET  0x90U /* Offset: 0x90 (R/W) Stream 5 Peripheral Address Register */
#define DMA_S5M0AR_OFFSET 0x94U /* Offset: 0x94 (R/W) Stream 5 Memory 0 Address Register   */
#define DMA_S5M1AR_OFFSET 0x98U /* Offset: 0x98 (R/W) Stream 5 Memory 1 Address Register   */
#define DMA_S5FCR_OFFSET  0x9CU /* Offset: 0x9C (R/W) Stream 5 FIFO Control Register       */
#define DMA_S6CR_OFFSET   0xA0U /* Offset: 0xA0 (R/W) Stream 6 Configuration Register      */
#define DMA_S6NDTR_OFFSET 0xA4U /* Offset: 0xA4 (R/W) Stream 6 Number of Data Register     */
#define DMA_S6PAR_OFFSET  0xA8U /* Offset: 0xA8 (R/W) Stream 6 Peripheral Address Register */
#define DMA_S6M0AR_OFFSET 0xACU /* Offset: 0xAC (R/W) Stream 6 Memory 0 Address Register   */
#define DMA_S6M1AR_OFFSET 0xB0U /* Offset: 0xB0 (R/W) Stream 6 Memory 1 Address Register   */
#define DMA_S6FCR_OFFSET  0xB4U /* Offset: 0xB4 (R/W) Stream 6 FIFO Control Register       */
#define DMA_S7CR_OFFSET   0xB8U /* Offset: 0xB8 (R/W) Stream 7 Configuration Register      */
#define DMA_S7NDTR_OFFSET 0xBCU /* Offset: 0xBC (R/W) Stream 7 Number of Data Register     */
#define DMA_S7PAR_OFFSET  0xC0U /* Offset: 0xC0 (R/W) Stream 7 Peripheral Address Register */
#define DMA_S7M0AR_OFFSET 0xC4U /* Offset: 0xC4 (R/W) Stream 7 Memory 0 Address Register   */
#define DMA_S7M1AR_OFFSET 0xC8U /* Offset: 0xC8 (R/W) Stream 7 Memory 1 Address Register   */
#define DMA_S7FCR_OFFSET  0xCCU /* Offset: 0xCC (R/W) Stream 7 FIFO Control Register       */

#define DMA1_B_ADDR 0x40026000
#define DMA2_B_ADDR 0x40026400

#define DMA1_LISR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_LISR_OFFSET))
#define DMA1_HISR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_HISR_OFFSET))
#define DMA1_LIFCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_LIFCR_OFFSET))
#define DMA1_HIFCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_HIFCR_OFFSET))
#define DMA1_S0CR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S0CR_OFFSET))
#define DMA1_S0NDTR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S0NDTR_OFFSET))
#define DMA1_S0PAR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S0PAR_OFFSET))
#define DMA1_S0M0AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S0M0AR_OFFSET))
#define DMA1_S0M1AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S0M1AR_OFFSET))
#define DMA1_S0FCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S0FCR_OFFSET))
#define DMA1_S1CR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S1CR_OFFSET))
#define DMA1_S1NDTR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S1NDTR_OFFSET))
#define DMA1_S1PAR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S1PAR_OFFSET))
#define DMA1_S1M0AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S1M0AR_OFFSET))
#define DMA1_S1M1AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S1M1AR_OFFSET))
#define DMA1_S1FCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S1FCR_OFFSET))
#define DMA1_S2CR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S2CR_OFFSET))
#define DMA1_S2NDTR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S2NDTR_OFFSET))
#define DMA1_S2PAR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S2PAR_OFFSET))
#define DMA1_S2M0AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S2M0AR_OFFSET))
#define DMA1_S2M1AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S2M1AR_OFFSET))
#define DMA1_S2FCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S2FCR_OFFSET))
#define DMA1_S3CR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S3CR_OFFSET))
#define DMA1_S3NDTR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S3NDTR_OFFSET))
#define DMA1_S3PAR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S3PAR_OFFSET))
#define DMA1_S3M0AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S3M0AR_OFFSET))
#define DMA1_S3M1AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S3M1AR_OFFSET))
#define DMA1_S3FCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S3FCR_OFFSET))
#define DMA1_S4CR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S4CR_OFFSET))
#define DMA1_S4NDTR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S4NDTR_OFFSET))
#define DMA1_S4PAR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S4PAR_OFFSET))
#define DMA1_S4M0AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S4M0AR_OFFSET))
#define DMA1_S4M1AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S4M1AR_OFFSET))
#define DMA1_S4FCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S4FCR_OFFSET))
#define DMA1_S5CR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S5CR_OFFSET))
#define DMA1_S5NDTR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S5NDTR_OFFSET))
#define DMA1_S5PAR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S5PAR_OFFSET))
#define DMA1_S5M0AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S5M0AR_OFFSET))
#define DMA1_S5M1AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S5M1AR_OFFSET))
#define DMA1_S5FCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S5FCR_OFFSET))
#define DMA1_S6CR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S6CR_OFFSET))
#define DMA1_S6NDTR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S6NDTR_OFFSET))
#define DMA1_S6PAR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S6PAR_OFFSET))
#define DMA1_S6M0AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S6M0AR_OFFSET))
#define DMA1_S6M1AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S6M1AR_OFFSET))
#define DMA1_S6FCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S6FCR_OFFSET))
#define DMA1_S7CR   *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S7CR_OFFSET))
#define DMA1_S7NDTR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S7NDTR_OFFSET))
#define DMA1_S7PAR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S7PAR_OFFSET))
#define DMA1_S7M0AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S7M0AR_OFFSET))
#define DMA1_S7M1AR *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S7M1AR_OFFSET))
#define DMA1_S7FCR  *((uint32_t volatile *)((uint8_t *)DMA1_B_ADDR + DMA_S7FCR_OFFSET))

