Dartlead/STM32F446RE/peripheral_library/private/_stm32f446re_registers.h
#define DMA2_LISR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_LISR_OFFSET))
#define DMA2_HISR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_HISR_OFFSET))
#define DMA2_LIFCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_LIFCR_OFFSET))
#define DMA2_HIFCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_HIFCR_OFFSET))
#define DMA2_S0CR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S0CR_OFFSET))
#define DMA2_S0NDTR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S0NDTR_OFFSET))
#define DMA2_S0PAR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S0PAR_OFFSET))
#define DMA2_S0M0AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S0M0AR_OFFSET))
#define DMA2_S0M1AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S0M1AR_OFFSET))
#define DMA2_S0FCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S0FCR_OFFSET))
#define DMA2_S1CR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S1CR_OFFSET))
#define DMA2_S1NDTR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S1NDTR_OFFSET))
#define DMA2_S1PAR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S1PAR_OFFSET))
#define DMA2_S1M0AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S1M0AR_OFFSET))
#define DMA2_S1M1AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S1M1AR_OFFSET))
#define DMA2_S1FCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S1FCR_OFFSET))
#define DMA2_S2CR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S2CR_OFFSET))
#define DMA2_S2NDTR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S2NDTR_OFFSET))
#define DMA2_S2PAR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S2PAR_OFFSET))
#define DMA2_S2M0AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S2M0AR_OFFSET))
#define DMA2_S2M1AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S2M1AR_OFFSET))
#define DMA2_S2FCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S2FCR_OFFSET))
#define DMA2_S3CR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S3CR_OFFSET))
#define DMA2_S3NDTR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S3NDTR_OFFSET))
#define DMA2_S3PAR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S3PAR_OFFSET))
#define DMA2_S3M0AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S3M0AR_OFFSET))
#define DMA2_S3M1AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S3M1AR_OFFSET))
#define DMA2_S3FCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S3FCR_OFFSET))
#define DMA2_S4CR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S4CR_OFFSET))
#define DMA2_S4NDTR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S4NDTR_OFFSET))
#define DMA2_S4PAR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S4PAR_OFFSET))
#define DMA2_S4M0AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S4M0AR_OFFSET))
#define DMA2_S4M1AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S4M1AR_OFFSET))
#define DMA2_S4FCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S4FCR_OFFSET))
#define DMA2_S5CR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S5CR_OFFSET))
#define DMA2_S5NDTR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S5NDTR_OFFSET))
#define DMA2_S5PAR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S5PAR_OFFSET))
#define DMA2_S5M0AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S5M0AR_OFFSET))
#define DMA2_S5M1AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S5M1AR_OFFSET))
#define DMA2_S5FCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S5FCR_OFFSET))
#define DMA2_S6CR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S6CR_OFFSET))
#define DMA2_S6NDTR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S6NDTR_OFFSET))
#define DMA2_S6PAR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S6PAR_OFFSET))
#define DMA2_S6M0AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S6M0AR_OFFSET))
#define DMA2_S6M1AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S6M1AR_OFFSET))
#define DMA2_S6FCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S6FCR_OFFSET))
#define DMA2_S7CR   *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S7CR_OFFSET))
#define DMA2_S7NDTR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S7NDTR_OFFSET))
#define DMA2_S7PAR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S7PAR_OFFSET))
#define DMA2_S7M0AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S7M0AR_OFFSET))
#define DMA2_S7M1AR *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S7M1AR_OFFSET))
#define DMA2_S7FCR  *((uint32_t volatile *)((uint8_t *)DMA2_B_ADDR + DMA_S7FCR_OFFSET))

/* ============================================================================================================= */
/* Nested Vectored Interrupt Controller Registers (NVIC)                                                         */
/* Address Range: 0xE000 E100 - 0xE000 EF00                                                                      */
/* ============================================================================================================= */
#define NVIC_ISER0_OFFSET 0x00U  /* Offset: 0x00  (R/W) Interrupt Set Enable Register 0     */
#define NVIC_ISER1_OFFSET 0x04U  /* Offset: 0x04  (R/W) Interrupt Set Enable Register 1     */
#define NVIC_ISER2_OFFSET 0x08U  /* Offset: 0x08  (R/W) Interrupt Set Enable Register 2     */
#define NVIC_ISER3_OFFSET 0x0CU  /* Offset: 0x0C  (R/W) Interrupt Set Enable Register 3     */
#define NVIC_ISER4_OFFSET 0x10U  /* Offset: 0x10  (R/W) Interrupt Set Enable Register 4     */
#define NVIC_ISER5_OFFSET 0x14U  /* Offset: 0x14  (R/W) Interrupt Set Enable Register 5     */
#define NVIC_ISER6_OFFSET 0x18U  /* Offset: 0x18  (R/W) Interrupt Set Enable Register 6     */
#define NVIC_ISER7_OFFSET 0x1CU  /* Offset: 0x1C  (R/W) Interrupt Set Enable Register 7     */
#define NVIC_ICER0_OFFSET 0x80U  /* Offset: 0x80  (R/W) Interrupt Clear Enable Register 0   */
#define NVIC_ICER1_OFFSET 0x84U  /* Offset: 0x84  (R/W) Interrupt Clear Enable Register 1   */
#define NVIC_ICER2_OFFSET 0x88U  /* Offset: 0x88  (R/W) Interrupt Clear Enable Register 2   */
#define NVIC_ICER3_OFFSET 0x8CU  /* Offset: 0x8C  (R/W) Interrupt Clear Enable Register 3   */
#define NVIC_ICER4_OFFSET 0x90U  /* Offset: 0x90  (R/W) Interrupt Clear Enable Register 4   */
#define NVIC_ICER5_OFFSET 0x94U  /* Offset: 0x94  (R/W) Interrupt Clear Enable Register 5   */
#define NVIC_ICER6_OFFSET 0x98U  /* Offset: 0x98  (R/W) Interrupt Clear Enable Register 6   */
#define NVIC_ICER7_OFFSET 0x9CU  /* Offset: 0x9C  (R/W) Interrupt Clear Enable Register 7   */
#define NVIC_ISPR0_OFFSET 0x100U /* Offset: 0x100 (R/W) Interrupt Set Pending Register 0    */
#define NVIC_ISPR1_OFFSET 0x104U /* Offset: 0x104 (R/W) Interrupt Set Pending Register 1    */
#define NVIC_ISPR2_OFFSET 0x108U /* Offset: 0x108 (R/W) Interrupt Set Pending Register 2    */
#define NVIC_ISPR3_OFFSET 0x10CU /* Offset: 0x10C (R/W) Interrupt Set Pending Register 3    */
#define NVIC_ISPR4_OFFSET 0x110U /* Offset: 0x110 (R/W) Interrupt Set Pending Register 4    */
#define NVIC_ISPR5_OFFSET 0x114U /* Offset: 0x114 (R/W) Interrupt Set Pending Register 5    */
#define NVIC_ISPR6_OFFSET 0x118U /* Offset: 0x118 (R/W) Interrupt Set Pending Register 6    */
#define NVIC_ISPR7_OFFSET 0x11CU /* Offset: 0x11C (R/W) Interrupt Set Pending Register 7    */
#define NVIC_ICPR0_OFFSET 0x180U /* Offset: 0x180 (R/W) Interrupt Clear Pending Register 0  */
#define NVIC_ICPR1_OFFSET 0x184U /* Offset: 0x184 (R/W) Interrupt Clear Pending Register 1  */
#define NVIC_ICPR2_OFFSET 0x188U /* Offset: 0x188 (R/W) Interrupt Clear Pending Register 2  */
#define NVIC_ICPR3_OFFSET 0x18CU /* Offset: 0x18C (R/W) Interrupt Clear Pending Register 3  */
#define NVIC_ICPR4_OFFSET 0x190U /* Offset: 0x190 (R/W) Interrupt Clear Pending Register 4  */
#define NVIC_ICPR5_OFFSET 0x194U /* Offset: 0x194 (R/W) Interrupt Clear Pending Register 5  */
#define NVIC_ICPR6_OFFSET 0x198U /* Offset: 0x194 (R/W) Interrupt Clear Pending Register 6  */
#define NVIC_ICPR7_OFFSET 0x19CU /* Offset: 0x19C (R/W) Interrupt Clear Pending Register 7  */
#define NVIC_IABR0_OFFSET 0x200U /* Offset: 0x200 (R/W) Interrupt Active Bit Register 0     */
#define NVIC_IABR1_OFFSET 0x204U /* Offset: 0x204 (R/W) Interrupt Active Bit Register 1     */
#define NVIC_IABR2_OFFSET 0x208U /* Offset: 0x208 (R/W) Interrupt Active Bit Register 2     */
#define NVIC_IABR3_OFFSET 0x20CU /* Offset: 0x20C (R/W) Interrupt Active Bit Register 3     */
#define NVIC_IABR4_OFFSET 0x210U /* Offset: 0x210 (R/W) Interrupt Active Bit Register 4     */
#define NVIC_IABR5_OFFSET 0x214U /* Offset: 0x214 (R/W) Interrupt Active Bit Register 5     */
#define NVIC_IABR6_OFFSET 0x218U /* Offset: 0x218 (R/W) Interrupt Active Bit Register 6     */
#define NVIC_IABR7_OFFSET 0x21CU /* Offset: 0x21C (R/W) Interrupt Active Bit Register 7     */
#define NVIC_IP0_OFFSET   0x300U /* Offset: 0x300 (R/W) Interrupt Priority Register 0       */
#define NVIC_IP1_OFFSET   0x304U /* Offset: 0x304 (R/W) Interrupt Priority Register 1       */
#define NVIC_IP2_OFFSET   0x308U /* Offset: 0x308 (R/W) Interrupt Priority Register 2       */
#define NVIC_IP3_OFFSET   0x30CU /* Offset: 0x30C (R/W) Interrupt Priority Register 3       */
#define NVIC_IP4_OFFSET   0x310U /* Offset: 0x300 (R/W) Interrupt Priority Register 4       */
#define NVIC_IP5_OFFSET   0x314U /* Offset: 0x300 (R/W) Interrupt Priority Register 5       */
#define NVIC_IP6_OFFSET   0x318U /* Offset: 0x300 (R/W) Interrupt Priority Register 6       */
#define NVIC_IP7_OFFSET   0x31CU /* Offset: 0x300 (R/W) Interrupt Priority Register 7       */
#define NVIC_IP8_OFFSET   0x320U /* Offset: 0x300 (R/W) Interrupt Priority Register 8       */
#define NVIC_IP9_OFFSET   0x324U /* Offset: 0x300 (R/W) Interrupt Priority Register 9      */
#define NVIC_IP10_OFFSET  0x328U /* Offset: 0x300 (R/W) Interrupt Priority Register 10      */
#define NVIC_IP11_OFFSET  0x32CU /* Offset: 0x300 (R/W) Interrupt Priority Register 11      */
#define NVIC_IP12_OFFSET  0x330U /* Offset: 0x300 (R/W) Interrupt Priority Register 12      */
#define NVIC_IP13_OFFSET  0x334U /* Offset: 0x300 (R/W) Interrupt Priority Register 13      */
#define NVIC_IP14_OFFSET  0x338U /* Offset: 0x300 (R/W) Interrupt Priority Register 14      */
#define NVIC_IP15_OFFSET  0x33CU /* Offset: 0x300 (R/W) Interrupt Priority Register 15      */
#define NVIC_IP16_OFFSET  0x340U /* Offset: 0x300 (R/W) Interrupt Priority Register 16      */
#define NVIC_IP17_OFFSET  0x344U /* Offset: 0x300 (R/W) Interrupt Priority Register 17      */
#define NVIC_IP18_OFFSET  0x348U /* Offset: 0x300 (R/W) Interrupt Priority Register 18      */
#define NVIC_IP19_OFFSET  0x34CU /* Offset: 0x300 (R/W) Interrupt Priority Register 19      */
#define NVIC_IP20_OFFSET  0x350U /* Offset: 0x300 (R/W) Interrupt Priority Register 20      */
#define NVIC_IP21_OFFSET  0x354U /* Offset: 0x300 (R/W) Interrupt Priority Register 21      */
#define NVIC_IP22_OFFSET  0x358U /* Offset: 0x300 (R/W) Interrupt Priority Register 22      */
#define NVIC_IP23_OFFSET  0x35CU /* Offset: 0x300 (R/W) Interrupt Priority Register 23      */
#define NVIC_IP24_OFFSET  0x360U /* Offset: 0x300 (R/W) Interrupt Priority Register 24      */
#define NVIC_IP25_OFFSET  0x364U /* Offset: 0x300 (R/W) Interrupt Priority Register 25      */
#define NVIC_IP26_OFFSET  0x368U /* Offset: 0x300 (R/W) Interrupt Priority Register 26      */
#define NVIC_IP27_OFFSET  0x36CU /* Offset: 0x300 (R/W) Interrupt Priority Register 27      */
#define NVIC_IP28_OFFSET  0x370U /* Offset: 0x300 (R/W) Interrupt Priority Register 28      */
#define NVIC_IP29_OFFSET  0x374U /* Offset: 0x300 (R/W) Interrupt Priority Register 29      */
#define NVIC_IP30_OFFSET  0x378U /* Offset: 0x300 (R/W) Interrupt Priority Register 30      */
#define NVIC_IP31_OFFSET  0x37CU /* Offset: 0x300 (R/W) Interrupt Priority Register 31      */
#define NVIC_IP32_OFFSET  0x380U /* Offset: 0x300 (R/W) Interrupt Priority Register 32      */
#define NVIC_IP33_OFFSET  0x384U /* Offset: 0x300 (R/W) Interrupt Priority Register 33      */
#define NVIC_IP34_OFFSET  0x388U /* Offset: 0x300 (R/W) Interrupt Priority Register 34      */
#define NVIC_IP35_OFFSET  0x38CU /* Offset: 0x300 (R/W) Interrupt Priority Register 35      */
#define NVIC_IP36_OFFSET  0x390U /* Offset: 0x300 (R/W) Interrupt Priority Register 36      */
#define NVIC_IP37_OFFSET  0x394U /* Offset: 0x300 (R/W) Interrupt Priority Register 37      */
#define NVIC_IP38_OFFSET  0x398U /* Offset: 0x300 (R/W) Interrupt Priority Register 38      */
#define NVIC_IP39_OFFSET  0x39CU /* Offset: 0x300 (R/W) Interrupt Priority Register 39      */
#define NVIC_IP40_OFFSET  0x3A0U /* Offset: 0x300 (R/W) Interrupt Priority Register 40      */
#define NVIC_IP41_OFFSET  0x3A4U /* Offset: 0x300 (R/W) Interrupt Priority Register 41      */
#define NVIC_IP42_OFFSET  0x3A8U /* Offset: 0x300 (R/W) Interrupt Priority Register 42      */
#define NVIC_IP43_OFFSET  0x3ACU /* Offset: 0x300 (R/W) Interrupt Priority Register 43      */
#define NVIC_IP44_OFFSET  0x3B0U /* Offset: 0x300 (R/W) Interrupt Priority Register 44      */
#define NVIC_IP45_OFFSET  0x3B4U /* Offset: 0x300 (R/W) Interrupt Priority Register 45      */
#define NVIC_IP46_OFFSET  0x3B8U /* Offset: 0x300 (R/W) Interrupt Priority Register 46      */
#define NVIC_IP47_OFFSET  0x3BCU /* Offset: 0x300 (R/W) Interrupt Priority Register 47      */
#define NVIC_IP48_OFFSET  0x3C0U /* Offset: 0x300 (R/W) Interrupt Priority Register 48      */
#define NVIC_IP49_OFFSET  0x3C4U /* Offset: 0x300 (R/W) Interrupt Priority Register 49      */
#define NVIC_IP50_OFFSET  0x3C8U /* Offset: 0x300 (R/W) Interrupt Priority Register 50      */
#define NVIC_IP51_OFFSET  0x3CCU /* Offset: 0x300 (R/W) Interrupt Priority Register 51      */
#define NVIC_IP52_OFFSET  0x3D0U /* Offset: 0x300 (R/W) Interrupt Priority Register 52      */
#define NVIC_IP53_OFFSET  0x3D4U /* Offset: 0x300 (R/W) Interrupt Priority Register 53      */
#define NVIC_IP54_OFFSET  0x3D8U /* Offset: 0x300 (R/W) Interrupt Priority Register 54      */
#define NVIC_IP55_OFFSET  0x3D8U /* Offset: 0x300 (R/W) Interrupt Priority Register 55      */
#define NVIC_IP56_OFFSET  0x3DCU /* Offset: 0x300 (R/W) Interrupt Priority Register 56      */
#define NVIC_IP57_OFFSET  0x3E0U /* Offset: 0x300 (R/W) Interrupt Priority Register 57      */
#define NVIC_IP58_OFFSET  0x3E4U /* Offset: 0x300 (R/W) Interrupt Priority Register 58      */
#define NVIC_IP59_OFFSET  0x3E8U /* Offset: 0x300 (R/W) Interrupt Priority Register 59      */
#define NVIC_STIR_OFFSET  0xE00U /* Offset: 0xE00 ( /W) Software Trigger Interrupt Register */

#define NVIC_B_ADDR 0xE000E100

#define NVIC_ISER0 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISER0_OFFSET))
#define NVIC_ISER1 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISER1_OFFSET))
#define NVIC_ISER2 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISER2_OFFSET))
#define NVIC_ISER3 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISER3_OFFSET))
#define NVIC_ISER4 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISER4_OFFSET))
#define NVIC_ISER5 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISER5_OFFSET))
#define NVIC_ISER6 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISER6_OFFSET))
#define NVIC_ISER7 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISER7_OFFSET))
#define NVIC_ICER0 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICER0_OFFSET))
#define NVIC_ICER1 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICER1_OFFSET))
#define NVIC_ICER2 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICER2_OFFSET))
#define NVIC_ICER3 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICER3_OFFSET))
#define NVIC_ICER4 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICER4_OFFSET))
#define NVIC_ICER5 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICER5_OFFSET))
#define NVIC_ICER6 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICER6_OFFSET))
#define NVIC_ICER7 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICER7_OFFSET))
#define NVIC_ISPR0 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISPR0_OFFSET))
#define NVIC_ISPR1 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISPR1_OFFSET))
#define NVIC_ISPR2 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISPR2_OFFSET))
#define NVIC_ISPR3 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISPR3_OFFSET))
#define NVIC_ISPR4 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISPR4_OFFSET))
#define NVIC_ISPR5 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISPR5_OFFSET))
#define NVIC_ISPR6 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISPR6_OFFSET))
#define NVIC_ISPR7 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ISPR7_OFFSET))
#define NVIC_ICPR0 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICPR0_OFFSET))
#define NVIC_ICPR1 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICPR1_OFFSET))
#define NVIC_ICPR2 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICPR2_OFFSET))
#define NVIC_ICPR3 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICPR3_OFFSET))
#define NVIC_ICPR4 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICPR4_OFFSET))
#define NVIC_ICPR5 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICPR5_OFFSET))
#define NVIC_ICPR6 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICPR6_OFFSET))
#define NVIC_ICPR7 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_ICPR7_OFFSET))
#define NVIC_IABR0 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IABR0_OFFSET))
#define NVIC_IABR1 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IABR1_OFFSET))
#define NVIC_IABR2 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IABR2_OFFSET))
#define NVIC_IABR3 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IABR3_OFFSET))
#define NVIC_IABR4 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IABR4_OFFSET))
#define NVIC_IABR5 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IABR5_OFFSET))
#define NVIC_IABR6 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IABR6_OFFSET))
#define NVIC_IABR7 *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IABR7_OFFSET))
#define NVIC_IP0   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP0_OFFSET))
#define NVIC_IP1   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP1_OFFSET))
#define NVIC_IP2   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP2_OFFSET))
#define NVIC_IP3   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP3_OFFSET))
#define NVIC_IP4   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP4_OFFSET))
#define NVIC_IP5   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP5_OFFSET))
#define NVIC_IP6   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP6_OFFSET))
#define NVIC_IP7   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP7_OFFSET))
#define NVIC_IP8   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP8_OFFSET))
#define NVIC_IP9   *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP9_OFFSET))
#define NVIC_IP10  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP10_OFFSET))
#define NVIC_IP11  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP11_OFFSET))
#define NVIC_IP12  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP12_OFFSET))
#define NVIC_IP13  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP13_OFFSET))
#define NVIC_IP14  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP14_OFFSET))
#define NVIC_IP15  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP15_OFFSET))
#define NVIC_IP16  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP16_OFFSET))
#define NVIC_IP17  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP17_OFFSET))
#define NVIC_IP18  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP18_OFFSET))
#define NVIC_IP19  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP19_OFFSET))
#define NVIC_IP20  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP20_OFFSET))
#define NVIC_IP21  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP21_OFFSET))
#define NVIC_IP22  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP22_OFFSET))
#define NVIC_IP23  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP23_OFFSET))
#define NVIC_IP24  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP24_OFFSET))
#define NVIC_IP25  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP25_OFFSET))
#define NVIC_IP26  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP26_OFFSET))
#define NVIC_IP27  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP27_OFFSET))
#define NVIC_IP28  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP28_OFFSET))
#define NVIC_IP29  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP29_OFFSET))
#define NVIC_IP30  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP30_OFFSET))
#define NVIC_IP31  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP31_OFFSET))
#define NVIC_IP32  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP32_OFFSET))
#define NVIC_IP33  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP33_OFFSET))
#define NVIC_IP34  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP34_OFFSET))
#define NVIC_IP35  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP35_OFFSET))
#define NVIC_IP36  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP36_OFFSET))
#define NVIC_IP37  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP37_OFFSET))
#define NVIC_IP38  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP38_OFFSET))
#define NVIC_IP39  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP39_OFFSET))
#define NVIC_IP40  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP40_OFFSET))
#define NVIC_IP41  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP41_OFFSET))
#define NVIC_IP42  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP42_OFFSET))
#define NVIC_IP43  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP43_OFFSET))
#define NVIC_IP44  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP44_OFFSET))
#define NVIC_IP45  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP45_OFFSET))
#define NVIC_IP46  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP46_OFFSET))
#define NVIC_IP47  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP47_OFFSET))
#define NVIC_IP48  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP48_OFFSET))
#define NVIC_IP49  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP49_OFFSET))
#define NVIC_IP50  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP50_OFFSET))
#define NVIC_IP51  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP51_OFFSET))
#define NVIC_IP52  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP52_OFFSET))
#define NVIC_IP53  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP53_OFFSET))
#define NVIC_IP54  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP54_OFFSET))
#define NVIC_IP55  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP55_OFFSET))
#define NVIC_IP56  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP56_OFFSET))
#define NVIC_IP57  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP57_OFFSET))
#define NVIC_IP58  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP58_OFFSET))
#define NVIC_IP59  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_IP59_OFFSET))
#define NVIC_STIR  *((uint32_t volatile *)((uint8_t *)NVIC_B_ADDR + NVIC_STIR_OFFSET))

