Dartlead/STM32F446RE/peripheral_library/private/_stm32f446re_registers.h
/* ============================================================================================================= */
/* System Control Block Registers (SCB)                                                                          */
/* Address Range: 0xE000 ED00 - 0xE000 ED40                                                                      */
/* ============================================================================================================= */
#define SCB_CPUID_OFFSET 0x00U /* Offset: 0x00 (R/ ) CPUID Base Register                             */
#define SCB_ICSR_OFFSET  0x04U /* Offset: 0x04 (R/W) Interrupt Control and State Register            */
#define SCB_VTOR_OFFSET  0x08U /* Offset: 0x08 (R/W) Vector Table Offset Register                    */
#define SCB_AIRCR_OFFSET 0x0CU /* Offset: 0x0C (R/W) Application Interupt and Reset Control Register */
#define SCB_SCR_OFFSET   0x10U /* Offset: 0x10 (R/W) System Control Register                         */
#define SCB_CCR_OFFSET   0x14U /* Offset: 0x14 (R/W) Configuration Control Register                  */
#define SCB_SHP0_OFFSET  0x18U /* Offset: 0x18 (R/W) System Handlers Priority Register 0 (4-7)       */
#define SCB_SHP1_OFFSET  0x1CU /* Offset: 0x1C (R/W) System Handlers Priority Register 1 (8-11)      */
#define SCB_SHP2_OFFSET  0x20U /* Offset: 0x20 (R/W) System Handlers Priority Register 2 (12-15)     */
#define SCB_SHCSR_OFFSET 0x24U /* Offset: 0x24 (R/W) System Handler Control and State Register       */
#define SCB_CFSR_OFFSET  0x28U /* Offset: 0x28 (R/W) Configurable Fault Status Register              */
#define SCB_HFSR_OFFSET  0x2CU /* Offset: 0x2C (R/W) Hard Fault Status Register                      */
#define SCB_DFSR_OFFSET  0x30U /* Offset: 0x30 (R/W) Debug Fault Status Register                     */
#define SCB_MMFAR_OFFSET 0x34U /* Offset: 0x34 (R/W) Memory Management Fault Status Register         */
#define SCB_BFAR_OFFSET  0x38U /* Offset: 0x38 (R/W) Bus Fault Address Register                      */
#define SCB_AFSR_OFFSET  0x3CU /* Offset: 0x3C (R/W) Auxiliary Fault Status Register                 */
#define SCB_PFR0_OFFSET  0x40U /* Offset: 0x40 (R/ ) Processor Feature Register 0                    */
#define SCB_PFR1_OFFSET  0x44U /* Offset: 0x44 (R/ ) Processor Feature Register 1                    */
#define SCB_DFR_OFFSET   0x48U /* Offset: 0x48 (R/ ) Debug Feature Register                          */
#define SCB_ADR_OFFSET   0x4CU /* Offset: 0x4C (R/ ) Axuiliary Feature Register                      */
#define SCB_MMFR0_OFFSET 0x50U /* Offset: 0x50 (R/ ) Memory Model Feature Register 0                 */
#define SCB_MMFR1_OFFSET 0x54U /* Offset: 0x54 (R/ ) Memory Model Feature Register 1                 */
#define SCB_MMFR2_OFFSET 0x58U /* Offset: 0x58 (R/ ) Memory Model Feature Register 2                 */
#define SCB_MMFR3_OFFSET 0x5CU /* Offset: 0x5C (R/ ) Memory Model Feature Register 3                 */
#define SCB_ISAR0_OFFSET 0x60U /* Offset: 0x60 (R/ ) Instruction Set Attributes Register 0           */
#define SCB_ISAR1_OFFSET 0x64U /* Offset: 0x64 (R/ ) Instruction Set Attributes Register 1           */
#define SCB_ISAR2_OFFSET 0x68U /* Offset: 0x68 (R/ ) Instruction Set Attributes Register 2           */
#define SCB_ISAR3_OFFSET 0x6CU /* Offset: 0x6C (R/ ) Instruction Set Attributes Register 3           */
#define SCB_ISAR4_OFFSET 0x70U /* Offset: 0x70 (R/ ) Instruction Set Attributes Register 4           */
#define SCB_CPACR_OFFSET 0x88U /* Offset: 0x88 (R/W) Coprocessor Access Control Register             */

#define SCB_B_ADDR 0xE000ED00

#define SCB_CPUID *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_CPUID_OFFSET))
#define SCB_ICSR  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_ICSR_OFFSET))
#define SCB_VTOR  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_VTOR_OFFSET))
#define SCB_AIRCR *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_AIRCR_OFFSET))
#define SCB_SCR   *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_SCR_OFFSET))
#define SCB_CCR   *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_CCR_OFFSET))
#define SCB_SHP0  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_SHP0_OFFSET))
#define SCB_SHP1  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_SHP1_OFFSET))
#define SCB_SHP2  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_SHP2_OFFSET))
#define SCB_SHCSR *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_SHCSR_OFFSET))
#define SCB_CFSR  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_CFSR_OFFSET))
#define SCB_HFSR  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_HFSR_OFFSET))
#define SCB_DFSR  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_DFSR_OFFSET))
#define SCB_MMFAR *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_MMFAR_OFFSET))
#define SCB_BFAR  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_BFAR_OFFSET))
#define SCB_AFSR  *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_AFSR_OFFSET))
#define SCB_PFR0  *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_PFR0_OFFSET))
#define SCB_PFR1  *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_PFR1_OFFSET))
#define SCB_DFR   *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_DFR_OFFSET))
#define SCB_ADR   *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_ADR_OFFSET))
#define SCB_MMFR0 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_MMFR0_OFFSET))
#define SCB_MMFR1 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_MMFR1_OFFSET))
#define SCB_MMFR2 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_MMFR2_OFFSET))
#define SCB_MMFR3 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_MMFR3_OFFSET))
#define SCB_ISAR0 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_ISAR0_OFFSET))
#define SCB_ISAR1 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_ISAR1_OFFSET))
#define SCB_ISAR2 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_ISAR2_OFFSET))
#define SCB_ISAR3 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_ISAR3_OFFSET))
#define SCB_ISAR4 *((uint32_t volatile const *)((uint8_t *)SCB_B_ADDR + SCB_ISAR4_OFFSET))
#define SCB_CPACR *((uint32_t volatile       *)((uint8_t *)SCB_B_ADDR + SCB_CPACR_OFFSET))

#endif /* _STM32F446RE_REGISTERS_H */

/* EOF */
